InformationRegisters/ПР_ЗагруженныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПР_ЗагруженныеФайлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПР_ДоговорДолевогоУчастия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДоговорДолевогоУчастия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПР_ДоговорОснащения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДоговорОснащения</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеАгентскогоДоговора</xr:Item>
				<xr:Item>Document.ПР_АППЗастройщик</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОснащения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПР_ТипыОснащения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОснащения</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПогашения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПР_ДПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДПП</Name>
			<BasedOn>
				<xr:Item>Document.ПР_ДоговорДолевогоУчастия</xr:Item>
				<xr:Item>Document.АР17_ЗаключениеАгентскогоДоговора</xr:Item>
				<xr:Item>Document.ПР_ДоговорОтделки</xr:Item>
				<xr:Item>Document.ПР_АППЗастройщик</xr:Item>
				<xr:Item>Document.ПР_ДоговорОснащения</xr:Item>
				<xr:Item>Document.ПР_ДПП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОснащения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПР_ПричинаПередачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОснащения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОтделки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПР_ДоговорОтделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДоговорОтделки</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеАгентскогоДоговора</xr:Item>
				<xr:Item>Document.ПР_АППЗастройщик</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОтделки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПогашения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ПР_Сервер/Ext/Module.bsl
Процедура ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДок",			Источник.Дата);
	Запрос.УстановитьПараметр("СтрМесяц",			"%/" + Формат(Источник.ДатаНач,"ДФ=ММ") + "/" + Формат(Источник.ДатаНач,"ДФ=гг")+"%");
	МесяцГод = "/" + Формат(Источник.ДатаНач,"ДФ=ММ") + "/" + Формат(Источник.ДатаНач,"ДФ=гг");
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПР_Квитанция.Номер КАК Номер
	               |ИЗ
	               |	Документ.ПР_Квитанция КАК ПР_Квитанция
	               |ГДЕ
	               |	ПР_Квитанция.Номер ПОДОБНО &СтрМесяц
	               //|	И ПР_Квитанция.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаДок, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаДок, МЕСЯЦ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер УБЫВ";
				   
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		
		НрмерБезК = СокрЛП(Сред(Рез.Номер,3));
		ПоследнийНомерСтрокой = Сред(НрмерБезК,1,Найти(НрмерБезК,МесяцГод)-1);
		ПоследнийНомерЧислом = Число(ПоследнийНомерСтрокой) + 1;
		ПоследнийНомерСтрокой = СтрЗаменить(Строка(ПоследнийНомерЧислом)," ","");
		Пока СтрДлина(ПоследнийНомерСтрокой) < 4 Цикл
			ПоследнийНомерСтрокой = "0" + ПоследнийНомерСтрокой;
		КонецЦикла;
		
		а=а;
		
	Иначе
		
		ПоследнийНомерСтрокой = "0001";
		
	КонецЕсли;
	
	Источник.Номер = "К-" + ПоследнийНомерСтрокой + "/" + Формат(Источник.ДатаНач,"ДФ=ММ") + "/" + Формат(Источник.ДатаНач,"ДФ=гг"); 
	
КонецПроцедуры

Процедура ПР_ПриУстановкеНовогоНомераПриУстановкеНовогоНомераЗАД(Источник, СтандартнаяОбработка, Префикс) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПР_ДоговорДолевогоУчастия") Тогда	
		
		ЗапросНомер = Новый Запрос;
		ЗапросНомер.Текст = "ВЫБРАТЬ
		                    |	ВЫБОР
		                    |		КОГДА АР_ОбъектыАренды.Родитель.Родитель.НомерДДУ = """"
		                    |			ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.НомерДДУ
		                    |		ИНАЧЕ АР_ОбъектыАренды.Родитель.Родитель.НомерДДУ
		                    |	КОНЕЦ КАК НомерДДУ
		                    |ИЗ
		                    |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		                    |ГДЕ
		                    |	АР_ОбъектыАренды.Ссылка = &Ссылка";
		ЗапросНомер.УстановитьПараметр("Ссылка",Источник.Помещение);
		ВыборкаНомер = ЗапросНомер.Выполнить().Выбрать();
		//Если ВыборкаНомер.Следующий() Тогда
		ВыборкаНомер.Следующий();
		НомерКорпуса = ВыборкаНомер.НомерДДУ;
		Если ВыборкаНомер.НомерДДУ <> "" Тогда
				
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПОДСТРОКА(ПР_ДоговорДолевогоУчастия.Номер, 6, 5) КАК Номер,
			               |	ПР_ДоговорДолевогоУчастия.Номер КАК Номер1,
			               |	0 КАК Номер2
			               |ИЗ
			               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
			               |ГДЕ
			               |	ПР_ДоговорДолевогоУчастия.Ссылка <> &Ссылка
			               |	И ПОДСТРОКА(ПР_ДоговорДолевогоУчастия.Номер, 1, 4) = &НомерДДУ
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Номер УБЫВ";
			
			Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
			Запрос.УстановитьПараметр("НомерДДУ",ВыборкаНомер.НомерДДУ);
			Выборка = Запрос.Выполнить().Выбрать();
			Выгрузка = Запрос.Выполнить().Выгрузить();
			
			Если Выгрузка.Количество()>0 Тогда
				
				Для Каждого Стр из Выгрузка Цикл
					Если Найти(Стр.Номер,"/")>0 Тогда
						Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						Стр.Номер2 = Число(Стр.Номер);
					Иначе
						Стр.Номер2 = Число(Стр.Номер);
					КонецЕсли;	
				КонецЦикла;	
				
				Выгрузка.Сортировать("Номер2 Убыв");
				ПоследнийНомер = СтрЗаменить(Строка((Выгрузка[0].Номер2+1)),Символы.НПП,"");
				
			Иначе
				
				ПоследнийНомер = "1";
				
			КонецЕсли;
			
			Источник.Номер = НомерКорпуса + "/" + ПоследнийНомер + "/1";
		Иначе
			ЗапросД = Новый Запрос;
			ЗапросД.Текст = "ВЫБРАТЬ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер КАК Номер,
			                |	0 КАК Номер2
			                |ИЗ
			                |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
			                |ГДЕ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &Помещение
			                |
			                |УПОРЯДОЧИТЬ ПО
			                |	Номер УБЫВ";
			ЗапросД.УстановитьПараметр("Помещение",Источник.Помещение);
			//ЗапросД.УстановитьПараметр("Ссылка",Источник.Ссылка);
			ВыборкаНомерД = ЗапросД.Выполнить().Выбрать();
			
			//Выгрузка = ЗапросД.Выполнить().Выгрузить();
			
			Если ВыборкаНомерД.Следующий() Тогда
				ЗапросО = Новый Запрос;
				ЗапросО.Текст = "ВЫБРАТЬ
				                |	ПР_ДоговорДолевогоУчастия.Номер КАК Номер,
				                |	0 КАК Номер2
				                |ИЗ
				                |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
				                |ГДЕ
				                |	ПР_ДоговорДолевогоУчастия.Помещение = &Помещение
				                |	И ПР_ДоговорДолевогоУчастия.Ссылка <> &Ссылка
				                |
				                |УПОРЯДОЧИТЬ ПО
				                |	Номер УБЫВ";
				ЗапросО.УстановитьПараметр("Помещение",Источник.Помещение);
				ЗапросО.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомерО = ЗапросО.Выполнить().Выбрать();
				
				Выгрузка = ЗапросО.Выполнить().Выгрузить();
				
				Если Выгрузка.Количество()>0 Тогда
					
					Для Каждого Стр из Выгрузка Цикл
						ПозицияПоследнейЗапятой = 0;
						для ном = 1 по СтрДлина(Стр.Номер) цикл
							Если Символ(КодСимвола(Стр.Номер,ном)) = "/" тогда
								ПозицияПоследнейЗапятой = ном;
							КонецЕсли;
						конецЦикла;
						Стр.Номер2 = Сред(Стр.Номер,ПозицияПоследнейЗапятой+1);
					КонецЦикла;	
					
					Выгрузка.Сортировать("Номер2 Убыв");
					ПоследнийНомер = Строка((Выгрузка[0].Номер2+1));
					Источник.Номер = Лев(Выгрузка[0].Номер,ПозицияПоследнейЗапятой) + ПоследнийНомер;
					
				Иначе
					
					Источник.Номер = Сред(ВыборкаНомерД.Номер,3); 
					
				КонецЕсли;
	        Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ПР_ДоговорДолевогоУчастия.Номер КАК Номер,
				               |	0 КАК Номер2
				               |ИЗ
				               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
				               |ГДЕ
				               |	ПР_ДоговорДолевогоУчастия.Ссылка <> &Ссылка
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Номер УБЫВ";
				
				//Запрос.УстановитьПараметр("Помещение",Источник.Помещение);
				Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомер = Запрос.Выполнить().Выбрать();
				//ВыборкаНомер.Следующий();
				//Источник.Номер = Формат(Число(Прав(ВыборкаНомер.Номер,9))+1, "ЧЦ=9; ЧВН=; ЧГ=0");
				
				Выгрузка = Запрос.Выполнить().Выгрузить();
				
				Если Выгрузка.Количество()>0 Тогда
					
					Для Каждого Стр из Выгрузка Цикл
						ПозицияПоследнейЗапятой = 0;
						для ном = 1 по СтрДлина(Стр.Номер) цикл
							Если Символ(КодСимвола(Стр.Номер,ном)) = "/" тогда
								ПозицияПоследнейЗапятой = ном;
							КонецЕсли;
						конецЦикла;
						Стр.Номер2 = Сред(Стр.Номер,ПозицияПоследнейЗапятой+1);
					КонецЦикла;	
					
					Выгрузка.Сортировать("Номер2 Убыв");
					ПоследнийНомер = Строка((Выгрузка[0].Номер2+1));
					Источник.Номер = Лев(Выгрузка[0].Номер,ПозицияПоследнейЗапятой) + ПоследнийНомер;
					
				Иначе
					
					Источник.Номер = Сред(ВыборкаНомерД.Номер,3); 
					
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПР_ДоговорОснащения") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПР_ДоговорДолевогоУчастия.Номер КАК Номер,
		               |	0 КАК Номер2
		               |ИЗ
		               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
		               |ГДЕ
		               |	ПР_ДоговорДолевогоУчастия.Помещение = &Помещение
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Номер УБЫВ";
		
		Запрос.УстановитьПараметр("Помещение",Источник.Помещение);
		ВыборкаНомер = Запрос.Выполнить().Выбрать();
		Если ВыборкаНомер.Следующий() Тогда
			ЗапросД = Новый Запрос;
			ЗапросД.Текст = "ВЫБРАТЬ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер КАК Номер,
			                |	0 КАК Номер2
			                |ИЗ
			                |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
			                |ГДЕ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &Помещение
			                |
			                |УПОРЯДОЧИТЬ ПО
			                |	Номер УБЫВ";
			ЗапросД.УстановитьПараметр("Помещение",Источник.Помещение);
			ВыборкаНомерД = ЗапросД.Выполнить().Выбрать();
			Если ВыборкаНомерД.Следующий() Тогда
				ЗапросО = Новый Запрос;
				ЗапросО.Текст = "ВЫБРАТЬ
				                |	ПР_ДоговорОснащения.Номер КАК Номер,
				                |	0 КАК Номер2
				                |ИЗ
				                |	Документ.ПР_ДоговорОснащения КАК ПР_ДоговорОснащения
				                |ГДЕ
				                |	ПР_ДоговорОснащения.Помещение = &Помещение
				                |	И ПР_ДоговорОснащения.Ссылка <> &Ссылка
				                |
				                |УПОРЯДОЧИТЬ ПО
				                |	Номер УБЫВ";
				ЗапросО.УстановитьПараметр("Помещение",Источник.Помещение);
				ЗапросО.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомерО = ЗапросО.Выполнить().Выбрать();
				
				Выгрузка = ЗапросО.Выполнить().Выгрузить();
				
				Если Выгрузка.Количество()>0 Тогда
					
					Для Каждого Стр из Выгрузка Цикл
						ПозицияПоследнейЗапятой = 0;
						для ном = 1 по СтрДлина(Стр.Номер) цикл
							Если Символ(КодСимвола(Стр.Номер,ном)) = "/" тогда
								ПозицияПоследнейЗапятой = ном;
							КонецЕсли;
						конецЦикла;
						Стр.Номер2 = Сред(Стр.Номер,ПозицияПоследнейЗапятой+1);
					КонецЦикла;	
					
					Выгрузка.Сортировать("Номер2 Убыв");
					ПоследнийНомер = Строка((Выгрузка[0].Номер2+1));
					Источник.Номер = Лев(Выгрузка[0].Номер,ПозицияПоследнейЗапятой) + ПоследнийНомер;
					
				Иначе
					
					Источник.Номер = "О-" + Сред(ВыборкаНомерД.Номер,3); 
					
				КонецЕсли;
	        Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ПР_ДоговорОснащения.Номер КАК Номер
				               |ИЗ
				               |	Документ.ПР_ДоговорОснащения КАК ПР_ДоговорОснащения
				               |ГДЕ
				               |	ПР_ДоговорОснащения.Ссылка <> &Ссылка
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Номер УБЫВ";
				
				Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомер = Запрос.Выполнить().Выбрать();
				ВыборкаНомер.Следующий();
				Источник.Номер = "О-" + Формат(Число(Прав(ВыборкаНомер.Номер,9))+1, "ЧЦ=9; ЧВН=; ЧГ=0");
			КонецЕсли;	
			
		Иначе
			
			ЗапросД = Новый Запрос;
			ЗапросД.Текст = "ВЫБРАТЬ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер КАК Номер,
			                |	0 КАК Номер2
			                |ИЗ
			                |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
			                |ГДЕ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &Помещение
			                |
			                |УПОРЯДОЧИТЬ ПО
			                |	Номер УБЫВ";
			ЗапросД.УстановитьПараметр("Помещение",Источник.Помещение);
			//ЗапросД.УстановитьПараметр("Ссылка",Источник.Ссылка);
			ВыборкаНомерД = ЗапросД.Выполнить().Выбрать();
			
			//Выгрузка = ЗапросД.Выполнить().Выгрузить();
			
			Если ВыборкаНомерД.Следующий() Тогда
				ЗапросО = Новый Запрос;
				ЗапросО.Текст = "ВЫБРАТЬ
				                |	ПР_ДоговорОснащения.Номер КАК Номер,
				                |	0 КАК Номер2
				                |ИЗ
				                |	Документ.ПР_ДоговорОснащения КАК ПР_ДоговорОснащения
				                |ГДЕ
				                |	ПР_ДоговорОснащения.Помещение = &Помещение
				                |	И ПР_ДоговорОснащения.Ссылка <> &Ссылка
				                |
				                |УПОРЯДОЧИТЬ ПО
				                |	Номер УБЫВ";
				ЗапросО.УстановитьПараметр("Помещение",Источник.Помещение);
				ЗапросО.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомерО = ЗапросО.Выполнить().Выбрать();
				
				Выгрузка = ЗапросО.Выполнить().Выгрузить();
				
				Если Выгрузка.Количество()>0 Тогда
					
					Для Каждого Стр из Выгрузка Цикл
						ПозицияПоследнейЗапятой = 0;
						для ном = 1 по СтрДлина(Стр.Номер) цикл
							Если Символ(КодСимвола(Стр.Номер,ном)) = "/" тогда
								ПозицияПоследнейЗапятой = ном;
							КонецЕсли;
						конецЦикла;
						Стр.Номер2 = Сред(Стр.Номер,ПозицияПоследнейЗапятой+1);
					КонецЦикла;	
					
					Выгрузка.Сортировать("Номер2 Убыв");
					ПоследнийНомер = Строка((Выгрузка[0].Номер2+1));
					Источник.Номер = Лев(Выгрузка[0].Номер,ПозицияПоследнейЗапятой) + ПоследнийНомер;
					
				Иначе
					
					Источник.Номер = "О-" + Сред(ВыборкаНомерД.Номер,3); 
					
				КонецЕсли;
	        Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ПР_ДоговорОснащения.Номер КАК Номер
				               |ИЗ
				               |	Документ.ПР_ДоговорОснащения КАК ПР_ДоговорОснащения
				               |ГДЕ
				               |	ПР_ДоговорОснащения.Ссылка <> &Ссылка
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Номер УБЫВ";
				
				//Запрос.УстановитьПараметр("Помещение",Источник.Помещение);
				Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомер = Запрос.Выполнить().Выбрать();
				ВыборкаНомер.Следующий();
				Источник.Номер = "О-" + Формат(Число(Прав(ВыборкаНомер.Номер,9))+1, "ЧЦ=9; ЧВН=; ЧГ=0");
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_ЗаключениеАгентскогоДоговора") Тогда
		Если Источник.ОбъектыАренды.Количество() > 0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПР_ДоговорДолевогоУчастия.Номер КАК Номер,
			               |	0 КАК Номер2
			               |ИЗ
			               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
			               |ГДЕ
			               |	ПР_ДоговорДолевогоУчастия.Помещение = &Помещение
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Номер УБЫВ";
			
			Запрос.УстановитьПараметр("Помещение",Источник.ОбъектыАренды[0].ОбъектАренды);
			ВыборкаНомер = Запрос.Выполнить().Выбрать();
			ВыборкаНомер.Следующий();
			Источник.Номер = ВыборкаНомер.Номер;
			Если ВыборкаНомер.Номер = Неопределено Тогда
					
				Если Источник.Уступка Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка) КАК Количество
					               |ИЗ
					               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
					               |ГДЕ
					               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &ОбъектАренды
					               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Уступка
					               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка <> &Ссылка";
					
					Запрос.УстановитьПараметр("ОбъектАренды",Источник.ОбъектыАренды[0].ОбъектАренды);
					Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
					Выборка = Запрос.Выполнить().Выбрать();
					Выгрузка = Запрос.Выполнить().Выгрузить();
					//Выборка.Следующий();
					Если Выгрузка.Количество()>0 Тогда
						Источник.Номер = СокрЛП(Источник.Номер)+"у"+Строка(Выгрузка[0].Количество+1);
					Иначе
						Источник.Номер = Источник.Номер+"у1";
					КонецЕсли;	
				Иначе
					
					ЗапросНомер = Новый Запрос;
					ЗапросНомер.Текст = "ВЫБРАТЬ
					                    |	ВЫБОР
					                    |		КОГДА АР_ОбъектыАренды.Родитель.Родитель.НомерДДУ = """"
					                    |			ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.НомерДДУ
					                    |		ИНАЧЕ АР_ОбъектыАренды.Родитель.Родитель.НомерДДУ
					                    |	КОНЕЦ КАК НомерДДУ
					                    |ИЗ
					                    |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
					                    |ГДЕ
					                    |	АР_ОбъектыАренды.Ссылка = &Ссылка";
					ЗапросНомер.УстановитьПараметр("Ссылка",Источник.ОбъектыАренды[0].ОбъектАренды);
					ВыборкаНомер = ЗапросНомер.Выполнить().Выбрать();
					//Если ВыборкаНомер.Следующий() Тогда
					ВыборкаНомер.Следующий();
					НомерКорпуса = ВыборкаНомер.НомерДДУ;

					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Количество,
					               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер КАК Номер,
					               |	ВЫБОР
					               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Родитель.Родитель.НомерДДУ = """"
					               |			ТОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Родитель.Родитель.Родитель.НомерДДУ
					               |		ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Родитель.Родитель.НомерДДУ
					               |	КОНЕЦ КАК Поле1,
					               |	0 КАК Номер2
					               |ИЗ
					               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
					               |ГДЕ
					               |	НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Уступка
					               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка <> &Ссылка
					               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер ПОДОБНО &НомерДДУ
					               |
					               |ОБЪЕДИНИТЬ ВСЕ
					               |
					               |ВЫБРАТЬ
					               |	ПР_ДоговорДолевогоУчастия.Ссылка,
					               |	ПР_ДоговорДолевогоУчастия.Ссылка.Номер,
					               |	NULL,
					               |	0
					               |ИЗ
					               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
					               |ГДЕ
					               |	ПР_ДоговорДолевогоУчастия.Ссылка <> &Ссылка
					               |	И ПР_ДоговорДолевогоУчастия.Номер ПОДОБНО &НомерДДУ_"; 
					
					//Запрос.Текст = "ВЫБРАТЬ
					//               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Количество,
					//               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер КАК Номер,
					//               |	ВЫБОР
					//               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Родитель.Родитель.НомерДДУ = """"
					//               |			ТОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Родитель.Родитель.Родитель.НомерДДУ
					//               |		ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Родитель.Родитель.НомерДДУ
					//               |	КОНЕЦ КАК Поле1,
					//               |	0 КАК Номер2
					//               |ИЗ
					//               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
					//               |ГДЕ
					//               |	НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Уступка
					//               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка <> &Ссылка
					//               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер ПОДОБНО &НомерДДУ";
					
					Запрос.УстановитьПараметр("НомерДДУ","У-"+НомерКорпуса+"%");
					Запрос.УстановитьПараметр("НомерДДУ_",НомерКорпуса+"%");
					//ЗапросНомер.УстановитьПараметр("Ссылка",Источник.ОбъектыАренды[0].ОбъектАренды);
					Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
					Выборка = Запрос.Выполнить().Выбрать();
					Выгрузка = Запрос.Выполнить().Выгрузить();
					//Выборка.Следующий();
					Если Выгрузка.Количество()>0 Тогда
						//Разделитель = "/";       
						//ПозицияРазделителя = Найти(Стр.Номер,Разделитель);

						Для Каждого Стр из Выгрузка Цикл
							Разделитель = "/";       
							ПозицияРазделителя = Найти(Стр.Номер,Разделитель);
							НовыйНомер = Сред(Стр.Номер,ПозицияРазделителя+1);
							ПозицияРазделителя2 = Найти(НовыйНомер,"/");
							НомерЧисло = Число(Лев(НовыйНомер,ПозицияРазделителя2-1));
							Стр.Номер2 = НомерЧисло;
						КонецЦикла;	
						Выгрузка.Сортировать("Номер2 Убыв");
						а=а;
						//НовыйНомер
						Источник.Номер = "У-" + НомерКорпуса + "/" + Строка(Выгрузка[0].Номер2+1) + "/1";
					Иначе
						Источник.Номер = "У-" + НомерКорпуса + "/1/1"; 
						//Источник.Номер = СокрЛП(Источник.Номер)+"1";
					КонецЕсли;	
					
				КонецЕсли;
			Иначе
	                //
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Количество,
					               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер КАК Номер
					               |ИЗ
					               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
					               |ГДЕ
					               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &ОбъектАренды
					               |	И НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Уступка
					               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка <> &Ссылка";
					
					Запрос.УстановитьПараметр("ОбъектАренды",Источник.ОбъектыАренды[0].ОбъектАренды);
					Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
					Выборка = Запрос.Выполнить().Выбрать();
					Выгрузка = Запрос.Выполнить().Выгрузить();
					//Выборка.Следующий();
					Выгрузка.Сортировать("Номер Убыв");
					Если Выгрузка.Количество()>0 Тогда
						Ном = СокрЛП(Выгрузка[0].Номер);
						Если Лев(Ном,2) = "У-" Тогда
							Ном = Сред(Ном,3);
						КонецЕсли;	
						Разделитель = "/";       
						Часть = "";
						ПозицияРазделителя = Найти(Ном, Разделитель);
						Пока ПозицияРазделителя > 0 Цикл
						    Часть = Часть + Лев(Ном, ПозицияРазделителя);
						    Ном = Сред(Ном, ПозицияРазделителя + 1);
						    ПозицияРазделителя = Найти(Ном, Разделитель);
						КонецЦикла;
						Источник.Номер = Часть + Строка(Число(Ном)+1); 
					Иначе
						Источник.Номер = Источник.Номер+"1";
					КонецЕсли;	
				    //
				Если Источник.ВидДоговора = Справочники.АР_ВидыДоговоров.АгентскийДоговор Тогда
					Источник.Номер = "У-" + Источник.Номер;
				Иначе
					//Источник.Номер = "Д-" + Источник.Номер;
					Источник.Номер = "У-" + Источник.Номер;
				КонецЕсли;	
			КонецЕсли;
		Иначе
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПР_ДПП") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПР_ДоговорДолевогоУчастия.Номер КАК Номер,
		               |	0 КАК Номер2
		               |ИЗ
		               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
		               |ГДЕ
		               |	ПР_ДоговорДолевогоУчастия.Помещение = &Помещение
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Номер УБЫВ";
		
		Запрос.УстановитьПараметр("Помещение",Источник.Помещение);
		ВыборкаНомер = Запрос.Выполнить().Выбрать();
		ВыборкаНомер.Следующий();
		Источник.Номер = ВыборкаНомер.Номер;
		Если ВыборкаНомер.Номер = Неопределено Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Ссылка,
				               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер КАК Номер
				               |ИЗ
				               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
				               |ГДЕ
				               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &ОбъектАренды
				               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка <> &Ссылка";
				
				Запрос.УстановитьПараметр("ОбъектАренды",Источник.Помещение);
				Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
				Выборка = Запрос.Выполнить().Выбрать();
				Выгрузка = Запрос.Выполнить().Выгрузить();
				Выгрузка.Сортировать("Номер Убыв");
				//Выборка.Следующий();
				Если Выгрузка.Количество()>0 Тогда
					Источник.Номер = СокрЛП(Выгрузка[0].Номер)+"у"+Строка(Выгрузка.Количество());
				Иначе
					Источник.Номер = Источник.Номер+"у1";
				КонецЕсли;	
		Иначе
                //
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПР_ДПП.Ссылка) КАК Количество,
				               |	ПР_ДПП.Ссылка.Номер КАК Номер
				               |ИЗ
				               |	Документ.ПР_ДПП КАК ПР_ДПП
				               |ГДЕ
				               |	ПР_ДПП.Ссылка <> &Ссылка
				               |	И ПР_ДПП.Помещение = &Помещение
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	ПР_ДПП.Ссылка.Номер";
				
				Запрос.УстановитьПараметр("Помещение",Источник.Помещение);
				Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
				Выборка = Запрос.Выполнить().Выбрать();
				Выгрузка = Запрос.Выполнить().Выгрузить();
				//Выборка.Следующий();
				Если Выгрузка.Количество()>0 Тогда
					Ном = СокрЛП(Выгрузка[0].Номер);
					Разделитель = "/";       
					Часть = "";
					ПозицияРазделителя = Найти(Ном, Разделитель);
					Пока ПозицияРазделителя > 0 Цикл
					    Часть = Часть + Лев(Ном, ПозицияРазделителя);
					    Ном = Сред(Ном, ПозицияРазделителя + 1);
					    ПозицияРазделителя = Найти(Ном, Разделитель);
					КонецЦикла;
					//ПозицияРазделителя = Найти(Ном, "у");
					//Ном = Сред(Ном, ПозицияРазделителя + 1);
					//Источник.Номер = Часть + Строка(Число(Ном)+1);
					Источник.Номер = СокрЛП(Источник.Номер)+"у"+Строка(Выгрузка[0].Количество+1);
				Иначе
					Источник.Номер = Источник.Номер+"у1";
				КонецЕсли;	
			    //
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПР_ДоговорОтделки") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПР_ДоговорДолевогоУчастия.Номер КАК Номер,
		               |	0 КАК Номер2
		               |ИЗ
		               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
		               |ГДЕ
		               |	ПР_ДоговорДолевогоУчастия.Помещение = &Помещение
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Номер УБЫВ";
		
		Запрос.УстановитьПараметр("Помещение",Источник.Помещение);
		ВыборкаНомер = Запрос.Выполнить().Выбрать();
		Если ВыборкаНомер.Следующий() Тогда
			ЗапросД = Новый Запрос;
			ЗапросД.Текст = "ВЫБРАТЬ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер КАК Номер,
			                |	0 КАК Номер2
			                |ИЗ
			                |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
			                |ГДЕ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &Помещение
			                |
			                |УПОРЯДОЧИТЬ ПО
			                |	Номер УБЫВ";
			ЗапросД.УстановитьПараметр("Помещение",Источник.Помещение);
			ВыборкаНомерД = ЗапросД.Выполнить().Выбрать();
			Если ВыборкаНомерД.Следующий() Тогда
				ЗапросО = Новый Запрос;
				ЗапросО.Текст = "ВЫБРАТЬ
				                |	ПР_ДоговорОтделки.Номер КАК Номер,
				                |	0 КАК Номер2
				                |ИЗ
				                |	Документ.ПР_ДоговорОтделки КАК ПР_ДоговорОтделки
				                |ГДЕ
				                |	ПР_ДоговорОтделки.Помещение = &Помещение  
				                |	И ПР_ДоговорОтделки.Ссылка <> &Ссылка
				                |
				                |УПОРЯДОЧИТЬ ПО
				                |	Номер УБЫВ";
				ЗапросО.УстановитьПараметр("Помещение",Источник.Помещение);
				ЗапросО.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомерО = ЗапросО.Выполнить().Выбрать();
				
				Выгрузка = ЗапросО.Выполнить().Выгрузить();
				
				Если Выгрузка.Количество()>0 Тогда
					
					Для Каждого Стр из Выгрузка Цикл
						ПозицияПоследнейЗапятой = 0;
						для ном = 1 по СтрДлина(Стр.Номер) цикл
							Если Символ(КодСимвола(Стр.Номер,ном)) = "/" тогда
								ПозицияПоследнейЗапятой = ном;
							КонецЕсли;
						конецЦикла;
						Стр.Номер2 = Сред(Стр.Номер,ПозицияПоследнейЗапятой+1);
					КонецЦикла;	
					
					Выгрузка.Сортировать("Номер2 Убыв");
					ПоследнийНомер = Строка((Выгрузка[0].Номер2+1));
					Источник.Номер = Лев(Выгрузка[0].Номер,ПозицияПоследнейЗапятой) + ПоследнийНомер;
					
				Иначе
					
					Источник.Номер = "Отд-" + Сред(ВыборкаНомерД.Номер,3); 
					
				КонецЕсли;
	        Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ПР_ДоговорОтделки.Номер КАК Номер
				               |ИЗ
				               |	Документ.ПР_ДоговорОтделки КАК ПР_ДоговорОтделки
				               |ГДЕ
				               |	ПР_ДоговорОтделки.Ссылка <> &Ссылка
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Номер УБЫВ";
				
				Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомер = Запрос.Выполнить().Выбрать();
				ВыборкаНомер.Следующий();
				Источник.Номер = "Отд-" + Формат(Число(Прав(ВыборкаНомер.Номер,9))+1, "ЧЦ=9; ЧВН=; ЧГ=0");
			КонецЕсли;	
			
		Иначе
			
			ЗапросД = Новый Запрос;
			ЗапросД.Текст = "ВЫБРАТЬ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер КАК Номер,
			                |	0 КАК Номер2
			                |ИЗ
			                |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
			                |ГДЕ
			                |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &Помещение
			                |
			                |УПОРЯДОЧИТЬ ПО
			                |	Номер УБЫВ";
			ЗапросД.УстановитьПараметр("Помещение",Источник.Помещение);
			//ЗапросД.УстановитьПараметр("Ссылка",Источник.Ссылка);
			ВыборкаНомерД = ЗапросД.Выполнить().Выбрать();
			
			//Выгрузка = ЗапросД.Выполнить().Выгрузить();
			
			Если ВыборкаНомерД.Следующий() Тогда
				ЗапросО = Новый Запрос;
				ЗапросО.Текст = "ВЫБРАТЬ
				                |	ПР_ДоговорОтделки.Номер КАК Номер,
				                |	0 КАК Номер2
				                |ИЗ
				                |	Документ.ПР_ДоговорОтделки КАК ПР_ДоговорОтделки
				                |ГДЕ
				                |	ПР_ДоговорОтделки.Помещение = &Помещение
				                |	И ПР_ДоговорОтделки.Ссылка <> &Ссылка
				                |
				                |УПОРЯДОЧИТЬ ПО
				                |	Номер УБЫВ";
				ЗапросО.УстановитьПараметр("Помещение",Источник.Помещение);
				ЗапросО.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомерО = ЗапросО.Выполнить().Выбрать();
				
				Выгрузка = ЗапросО.Выполнить().Выгрузить();
				
				Если Выгрузка.Количество()>0 Тогда
					
					Для Каждого Стр из Выгрузка Цикл
						ПозицияПоследнейЗапятой = 0;
						для ном = 1 по СтрДлина(Стр.Номер) цикл
							Если Символ(КодСимвола(Стр.Номер,ном)) = "/" тогда
								ПозицияПоследнейЗапятой = ном;
							КонецЕсли;
						конецЦикла;
						Стр.Номер2 = Сред(Стр.Номер,ПозицияПоследнейЗапятой+1);
					КонецЦикла;	
					
					Выгрузка.Сортировать("Номер2 Убыв");
					ПоследнийНомер = Строка((Выгрузка[0].Номер2+1));
					Источник.Номер = Лев(Выгрузка[0].Номер,ПозицияПоследнейЗапятой) + ПоследнийНомер;
					
				Иначе
					
					Источник.Номер = "Отд-" + Сред(ВыборкаНомерД.Номер,3); 
					
				КонецЕсли;
	        Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ПР_ДоговорОтделки.Номер КАК Номер
				               |ИЗ
				               |	Документ.ПР_ДоговорОтделки КАК ПР_ДоговорОтделки
				               |ГДЕ
				               |	ПР_ДоговорОтделки.Ссылка <> &Ссылка
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Номер УБЫВ";
				
				//Запрос.УстановитьПараметр("Помещение",Источник.Помещение);
				Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
				ВыборкаНомер = Запрос.Выполнить().Выбрать();
				ВыборкаНомер.Следующий();
				Источник.Номер = "Отд-" + Формат(Число(Прав(ВыборкаНомер.Номер,9))+1, "ЧЦ=9; ЧВН=; ЧГ=0");
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;
КонецПроцедуры

Процедура ПР_ЗагрузитьВыписки() Экспорт 
	
КонецПроцедуры	

Процедура ПР_УдалениеФайлов() Экспорт
	НаборЗаписей = РегистрыСведений.ПР_ЗагруженныеФайлы.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();	//Для Каждого Запись Из НаборЗаписей Цикл
	Для Индекс = 1 - НаборЗаписей.Количество() По 0 Цикл
		Запись = НаборЗаписей[- Индекс];
		ФайлУдален = Ложь;
		Попытка
			УдалитьФайлы(СокрЛП(Запись.Файл));
			//ФайлУдален = Истина;
		Исключение
			//ФайлУдален = Ложь;
		КонецПопытки;
		Файл = Новый Файл(СокрЛП(Запись.Файл));
		Если Файл.Существует() Тогда
			ФайлУдален = Истина;
		Иначе
			ФайлУдален = Истина;
		КонецЕсли;	
		Если ФайлУдален Тогда
			НаборЗаписей.Удалить(- Индекс);
		КонецЕсли;	
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ПР_ЗагрузкаВыписок() Экспорт
	//Создали = Ложь;
	//КодБуквы = КодСимвола("L"); 
	//эт = 0;
	//Пока Не Создали И  Эт < 10 Цикл 
	//	КаталогПуть  = Новый Файл(Строка(Символ(КодБуквы)) +  ":\");
	//	Если КаталогПуть.Существует() Тогда
	//		КодБуквы = КодБуквы + 1;
	//		//КомандаСистемы("net use " + Строка(Символ(КодБуквы)) + ": /DELETE /PERSISTENT: YES");
	//	Иначе
	//		КС = Строка(Символ(КодБуквы)) + ":\personal_invest"; 
	//		//КомандаСистемы("net use " + Строка(Символ(КодБуквы)) + ": \\172.17.71.17\obmen\valo1C Z8GMFGJd1U3A3KCF /user:srv-dc71\srv1c");
	//		WshShell=Новый COMОбъект("Wscript.Shell");
	//		WshShell.run("net use " + Строка(Символ(КодБуквы)) + ": \\172.17.71.17\obmen\valo1C Z8GMFGJd1U3A3KCF /user:srv-dc71\srv1c");
	//		//ЗапуститьПриложение("net use " + Строка(Символ(КодБуквы)) + ": \\172.17.71.17\obmen\valo1C Z8GMFGJd1U3A3KCF /user:srv-dc71\srv1c");
	//		Создали = Истина;
	//	КонецЕсли;
	//	Эт = Эт + 1;
	//КонецЦикла;		
	
	
	//КомандаСистемы("net use " + "Z" + ": \\172.17.71.17\valo1C Z8GMFGJd1U3A3KCF /user:srv-dc71\srv1c");
	
	//\\172.17.71.17\obmen\valo1C логин srv-dc71\srv1c пароль Z8GMFGJd1U3A3KCF	
	//Пути = НайтиФайлы("D:\1с\", "KL_to_1C_2.txt", Истина);  
	Пути = НайтиФайлы("D:\1с\111\", "*.txt", Ложь);  
	//Пути = НайтиФайлы("\\172.17.71.17\obmen\valo1C", "KL_to_1C.txt", Истина);
	
	Сч=1;
	Для Каждого Стр Из Пути Цикл
		МенеджерЗаписи = РегистрыСведений.ПР_ЗагруженныеФайлы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Файл = Стр.ПолноеИмя;
		МенеджерЗаписи.Записать();

		ВыбранныеФайлы = Новый Массив;
		ВыбранныеФайлы.Добавить(Стр.ПолноеИмя);
		ДополнительныеПараметры = Новый Структура;
		//ДополнительныеПараметры.Вставить("Форма", ПолучитьФорму("ЖурналДокументов.Деньги.Форма.БанковскиеВыписки"));
		ДополнительныеПараметры.Вставить("Кодировка", Неопределено);
		//
		ДополнительныеПараметры.Вставить("ИмяФайла", Стр.ПолноеИмя);
		ДополнительныеПараметры.Вставить("Файл", Стр);
		ДополнительныеПараметры.Вставить("Сч", Сч);
		
		ПомещаемыеФайлы = Новый Массив;
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ДополнительныеПараметры.ИмяФайла));

		//ЗагрузитьПродолжение(ВыбранныеФайлы,ДополнительныеПараметры);
		ЗагрузитьБанковскуюВыпискуНаСервереОбщая(ВыбранныеФайлы,ДополнительныеПараметры,Сч);
		Сч = Сч+1; 
		//УдалитьФайлы(Стр.ПолноеИмя);
		//ОбменСБанкомКлиент.ДиалогВыбораФайлаДляЗагрузкиЗавершение(ВыбранныеФайлы, ДополнительныеПараметры);
		//ПаузаНаСервере();
	КонецЦикла;
	//КомандаСистемы("net use " + Строка(Символ(КодБуквы)) + ": /DELETE /PERSISTENT: YES");
	//WshShell=Новый COMОбъект("Wscript.Shell");
	//   WshShell.run("net use " + Строка(Символ(КодБуквы)) + ": /DELETE /PERSISTENT: YES");

КонецПроцедуры 

Функция ЗагрузитьБанковскуюВыпискуНаСервереОбщая(ВыбранныеФайлы, ДополнительныеПараметры, Сч = 0) 
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ДополнительныеПараметры.ИмяФайла));
	
	ОписаниеФайла = ПомещаемыеФайлы.Получить(0);
	Кодировка = Неопределено;
	АдресХранилища = "";
	//
	СтруктураПараметров = Новый Структура;
	
	//Если РасширениеРаботыСФайламиПодключено
	//	И ТипЗнч(ОписаниеФайла) = Тип("ОписаниеПереданногоФайла")
	//	И ЗначениеЗаполнено(ОписаниеФайла.ПолноеИмя) Тогда
	//	СтруктураПараметров.Вставить("ФайлЗагрузки", ОписаниеФайла.ПолноеИмя);
	//Иначе
		СтруктураПараметров.Вставить("ФайлЗагрузки", ОписаниеФайла.Имя);
	//КонецЕсли;
	
	СтруктураПараметров.Вставить("АдресХранилищаРаспознанныеДанныеИзБанка",
		ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор));
	СтруктураПараметров.Вставить("Кодировка", Кодировка);
	Если Не ПустаяСтрока(ОписаниеФайла.Хранение) Тогда
		СтруктураПараметров.Вставить("ДвоичныеДанные", ПолучитьИзВременногоХранилища(ОписаниеФайла.Хранение));
	КонецЕсли;
	
	//
	СведенияОВладельцеБанковскогоСчетаИзКонтекста = Новый Структура;
	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Вставить("Организация",               Новый Массив);
	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Вставить("БанковскийСчетОрганизации", Новый Массив);
	//Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
	//	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Организация.Добавить(ОтборОрганизация);
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ОтборБанковскийСчет) Тогда
	//	СведенияОВладельцеБанковскогоСчетаИзКонтекста.БанковскийСчетОрганизации.Добавить(ОтборБанковскийСчет);
	//ИначеЕсли ИнтеграцияСБанкамиПодключена И ЕстьБанковскиеСчетаБезИнтеграции Тогда
	//	СведенияОВладельцеБанковскогоСчетаИзКонтекста.БанковскийСчетОрганизации.Добавить(БанковскиеСчетаБезИнтеграции.Счета);
	//КонецЕсли;
	
	СтруктураПараметров.Вставить("СведенияОВладельцеБанковскогоСчетаИзКонтекста", СведенияОВладельцеБанковскогоСчетаИзКонтекста);
	//Если ИнтеграцияСБанкамиПодключена И ЕстьБанковскиеСчетаБезИнтеграции Тогда
	//	СтруктураПараметров.Вставить("РежимИнтеграцииОграничиватьПериодВыписки", Истина);
	//КонецЕсли;
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка выписки из банка'");
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	НастройкиЗапуска.КлючФоновогоЗадания = Обработки.КлиентБанк.КлючФоновогоЗаданияЗагрузкаВыписки() + Строка(Сч);
	
	Обработки.КлиентБанк.ФоноваяЗагрузкаБанковскойВыпискиИзЖурнала(СтруктураПараметров, АдресХранилища, Истина);
	
	//Результат = ДлительныеОперации.ВыполнитьВФоне(
	//	"Обработки.КлиентБанк.ФоноваяЗагрузкаБанковскойВыпискиИзЖурнала",
	//	СтруктураПараметров,
	//	НастройкиЗапуска);
	//
	//Возврат Результат;
	
КонецФункции

Функция ПР_АдресОбъектаПоВиду(ТекЗдание,ВидАдреса, хз1="" ,хз2="" , СтрокаАдреса = "") Экспорт
	
	
	Результат = Новый Структура;
	Результат.Вставить("АдмОкруг","");
	Результат.Вставить("Город","");
	Результат.Вставить("Дом","");
	Результат.Вставить("Индекс","");
	Результат.Вставить("Квартира","");
	Результат.Вставить("КодОВД","");
	Результат.Вставить("Комментарий","");
	Результат.Вставить("Корпус","");
	Результат.Вставить("НаселенныйПункт","");
	Результат.Вставить("НомерДома","");
	Результат.Вставить("ОВД",Справочники.КВП_ОВД.ПустаяСсылка());
	Результат.Вставить("Период","");
	Результат.Вставить("Представление","");
	Результат.Вставить("Район","");
	Результат.Вставить("Регион","");
	Результат.Вставить("Страна","");
	Результат.Вставить("Строительный",Ложь);
	Результат.Вставить("Территория","");
	Результат.Вставить("ТипДома","");
	Результат.Вставить("ТипКвартиры","");
	Результат.Вставить("ТипКорпуса","");
	Результат.Вставить("Улица","");
	
	Если СтрокаАдреса <> ""	Тогда
		СтруктураАдреса = ЗарплатаКадры.СтруктураАдресаИзXML(СтрокаАдреса);
		Для Каждого Элемент Из СтруктураАдреса Цикл
            Если Результат.Свойство(Элемент.Ключ) Тогда
				Результат.Вставить(Элемент.Ключ, Элемент.Значение);
            КонецЕсли;
		КонецЦикла
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции  

Функция ПР_ДоступныеЗначенияАдреса(ЗначенияПолейДляАнализа, ЗаполняемНомерДома) Экспорт 
	СЗ = Новый СписокЗначений;
	Если ЗначенияПолейДляАнализа.Количество()>0 Тогда
		СтруктураАдреса = ЗарплатаКадры.СтруктураАдресаИзXML(ЗначенияПолейДляАнализа[0].Значение);
		Если ЗаполняемНомерДома Тогда
			СЗ.Добавить(СтруктураАдреса.Дом);
		Иначе	
			СЗ.Добавить(СтруктураАдреса.Индекс + ", " + СтруктураАдреса.Регион + ", " + СтруктураАдреса.Улица + ", дом № " + СтруктураАдреса.Дом);
			СЗ.Добавить(СтруктураАдреса.Регион + ", " + СтруктураАдреса.Улица + ", дом № " + СтруктураАдреса.Дом);
			СЗ.Добавить(СтруктураАдреса.Улица + ", дом № " + СтруктураАдреса.Дом);
			СЗ.Добавить("дом № " + СтруктураАдреса.Дом);
		КонецЕсли;	
	КонецЕсли;	
	Возврат СЗ;
КонецФункции
